Strogino/src/Documents/УстановкаУчетныхЦенКонтрактов/УстановкаУчетныхЦенКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаУчетныхЦенКонтрактов</name>
  <registerRecords>InformationRegister.УчетныеЦеныНоменклатурыКонтрактов</registerRecords>
  <attributes>
    <name>ДержательКонтракта</name>
    <type>
      <types>CatalogRef.ДержателиКонтракта</types>
    </type>
  </attributes>
  <attributes>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.Контракты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/Documents/УстановкаУчетныхЦенКонтрактов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ЗаполнитьТовары(ВыбранноеЗначение.АдресТоваровВХранилище);
		
		Элементы.Товары.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьНоменклатуруИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТовары(АдресТоваровВХранилище);
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Нет данных для заполнения.'");
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		СтрокаТЧ = Объект.Товары.Добавить();
		СтрокаТЧ.Номенклатура = СтрокаТаблицы.Номенклатура;
		СтрокаТЧ.Цена = СтрокаТаблицы.Цена;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
